### DataFrame생성하기

In [1]:
import pandas as pd

In [2]:
data = {'2020':[9668465,3391946,28942828,1450062],'2010':[10312545,3567910,2758293,1454636]}
df = pd.DataFrame(data)
df

       2020      2010
0   9668465  10312545
1   3391946   3567910
2  28942828   2758293
3   1450062   1454636

In [3]:
#인덱스 번호를 원하는 값으로 바꿔주기
df.index = ['서울','부산','인천','광주']
df

        2020      2010
서울   9668465  10312545
부산   3391946   3567910
인천  28942828   2758293
광주   1450062   1454636

In [8]:
data = {'2020':[9668465,3391946,28942828,1450062],'2010':[10312545,3567910,2758293,1454636]}
df = pd.DataFrame(data,index = ['서울','부산','인천','광주'])
df

        2020      2010
서울   9668465  10312545
부산   3391946   3567910
인천  28942828   2758293
광주   1450062   1454636

In [13]:
data2= [[9668465,3391946,28942828,1450062],[10312545,3567910,2758293,1454636]]
ind = ['2020','2010']
col = ['서울','부산','인천','광주']
df2 = pd.DataFrame(data2,index=ind, columns=col)
df2

            서울       부산        인천       광주
2020   9668465  3391946  28942828  1450062
2010  10312545  3567910   2758293  1454636

In [14]:
df2.T   #T를 넣으면 행과 열의 위치가 바뀜

        2020      2010
서울   9668465  10312545
부산   3391946   3567910
인천  28942828   2758293
광주   1450062   1454636

In [15]:
df.values #datafame값만 확인

array([[ 9668465, 10312545],
       [ 3391946,  3567910],
       [28942828,  2758293],
       [ 1450062,  1454636]], dtype=int64)

In [17]:
df.index #dataframe 인덱스 확인

Index(['서울', '부산', '인천', '광주'], dtype='object')

In [18]:
df.columns #datafame 컬럼확인

Index(['2020', '2010'], dtype='object')

#### DataFrame 인덱싱&슬라이싱

In [19]:
#DataFrame 열 인덱싱
df['2020']   #series형태로 출력, dataframe형태로 출력하고 싶으면 df[['2020']]

서울     9668465
부산     3391946
인천    28942828
광주     1450062
Name: 2020, dtype: int64

In [20]:
df[['2020','2010']]

        2020      2010
서울   9668465  10312545
부산   3391946   3567910
인천  28942828   2758293
광주   1450062   1454636

In [21]:
df['2005']=[9762546,3512547,2517680,1456016]
df

        2020      2010     2005
서울   9668465  10312545  9762546
부산   3391946   3567910  3512547
인천  28942828   2758293  2517680
광주   1450062   1454636  1456016

#### DataFrame 행슬라이싱
- loc 인덱서 : 실제 인덱스명 또는 컬럼명을 사용 -> 변수명.loc[   :   ]
- iloc 인덱서 : numpy의 array인덱싱 방식으로 행을 가지고 올 때 사용, 파이썬 순서불러올때처럼 숫자 카운트

In [23]:
df[0:2]   #df['서울':'부산']

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547

In [25]:
df.loc['부산':'인천','2020':'2010']

        2020     2010
부산   3391946  3567910
인천  28942828  2758293

In [26]:
df.iloc[3]

2020    1450062
2010    1454636
2005    1456016
Name: 광주, dtype: int64

In [27]:
#Pandas Boolean 인덱싱
df['2010']>=2500000

서울     True
부산     True
인천     True
광주    False
Name: 2010, dtype: bool

In [28]:
df[df['2010']>=2500000]

        2020      2010     2005
서울   9668465  10312545  9762546
부산   3391946   3567910  3512547
인천  28942828   2758293  2517680

### .CSV파일 불러오기

In [55]:
population=pd.read_csv('population.csv',encoding='cp949')
#population=pd.read_csv('population.csv',encoding='euc-kr')
population

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [61]:
population=pd.read_csv('population.csv',index_col = '도시', encoding='cp949')
population     #인덱스번호 대신 도시를 인덱스로 사용하고 싶을 때 : index_col ='변수명'

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

- sort.index() : 인덱스값을 기준으로 정렬
- sort.value() : 데이터 값을 기준으로 정렬

In [39]:
population.sort_index()

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338

In [40]:
population['2010'].sort_values() #오름차순

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

In [41]:
population['2010'].sort_values(ascending = False) # 내림차순, True하면 오름차순

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64

In [42]:
population.sort_values(by='2010')  #기준점을 잡아서 정렬할 때 'by' 사용

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437

In [43]:
population.sort_values(by='2015')

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        NaN  2466338
부산  경상권  3448737        NaN        NaN  3655437
서울  수도권  9904312  9631482.0  9762546.0  9853972

In [46]:
population.sort_values(by=['지역','2015']) #두 개이상 보고싶으면, 리스트안에 넣어주기

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

In [62]:
population.sort_values(by=['2005','2000'])

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
부산  경상권  3448737        NaN        NaN  3655437

In [67]:
score=pd.read_csv('score.csv',index_col='과목',encoding='cp949')

In [68]:
score

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

In [69]:
score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [70]:
score.sum().sort_values(ascending=False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [71]:
score.sum(axis=1)          #행별로 합을 계산하고 싶을 때 : 'axis=1' 사용

과목
파이썬    201
DB     282
자바     253
크롤링    298
Web    163
dtype: int64

In [72]:
score['합계'] = score.sum(axis=1)
score

     1반  2반  3반  4반   합계
과목
파이썬  45  44  73  39  201
DB   76  92  45  69  282
자바   47  92  45  69  253
크롤링  92  81  85  40  298
Web  11  79  47  26  163

In [76]:
score['평균'] = score.loc[:,:'4반'].mean(axis=1)

In [77]:
score

     1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50
Web  11  79  47  26  163  40.75

In [78]:
score.max()

1반     92.0
2반     92.0
3반     85.0
4반     69.0
합계    298.0
평균     74.5
dtype: float64

In [79]:
score.min()

1반     11.00
2반     44.00
3반     45.00
4반     26.00
합계    163.00
평균     40.75
dtype: float64

In [80]:
score.max(axis=1)

과목
파이썬    201.0
DB     282.0
자바     253.0
크롤링    298.0
Web    163.0
dtype: float64

In [81]:
score.min(axis=1)

과목
파이썬    39.0
DB     45.0
자바     45.0
크롤링    40.0
Web    11.0
dtype: float64

In [83]:
#전체 반에서 과목별 제일 높은 점수 뽑기
score.loc[:,:'4반'].max(axis=1)

과목
파이썬    73
DB     92
자바     92
크롤링    92
Web    79
dtype: int64

In [87]:
#쌤 답
maxArr =  score.loc[:'Web',:'4반'].max(axis=1)
maxArr

과목
파이썬    73
DB     92
자바     92
크롤링    92
Web    79
dtype: int64

In [85]:
minArr =  score.loc[:'Web',:'4반'].min(axis=1)
minArr

과목
파이썬    39
DB     45
자바     45
크롤링    40
Web    11
dtype: int64

In [86]:
maxArr =  score.loc[:'Web',:'4반'].max(axis=0) #반별로 가장 높은 점수 구하기
maxArr

1반    92
2반    92
3반    85
4반    69
dtype: int64

In [88]:
maxArr - minArr

과목
파이썬    34
DB     47
자바     47
크롤링    52
Web    68
dtype: int64

In [93]:
#행 삭제 : 변수명.drop(['행이름','행이름'...],axis=1)  / 1차원에서는 삭제할 때 del사용
score.drop(['파이썬'])

     1반  2반  3반  4반   합계     평균
과목
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50
Web  11  79  47  26  163  40.75

In [94]:
#열삭제 : 변수명.drop(['열이름','열이름'...],axis=1)
score.drop(['2반'],axis=1)

     1반  3반  4반   합계     평균
과목
파이썬  45  73  39  201  50.25
DB   76  45  69  282  70.50
자바   47  45  69  253  63.25
크롤링  92  85  40  298  74.50
Web  11  47  26  163  40.75

#### df.appply(func,axis=0 or 1)
- 행이나 열 단위로 더 복잡한 처리를 하고 싶을 때 사용
- Pandas의 객체에 다른 라이브러리 함수를 적용하는 방법
- Pandas 객체에 열 혹은 행에 대해 함수를 적용하게 해주는 함수

In [95]:
data_dic = {'A':[1,3,3,4,4],'B':[1,2,2,3,3],'C':[1,2,4,4,5]}
df3 = pd.DataFrame(data_dic)
df3

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

In [96]:
# apply를 사용하여 각 열에 대해 어떤 값이 얼마나 사용되었는지 알아보기 
df4 = df3.apply(pd.value_counts)
df4

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

##### fillna() : 결측치를(NaN)를 원하는 값으로 바꾸는 기능

In [97]:
df4.fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

#### 카테고리만들기

In [98]:
ages = [0,2,10,21,23,37,31,61,20,41,32,100]
bins = [0,15,25,35,60,99]
labels = ["미성년자","청년","중년","장년","노년"]
cats=pd.cut(ages,bins,labels=labels)

In [99]:
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [100]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [101]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [104]:
ageArr=pd.DataFrame({'ages':ages})
ageArr

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   100

In [109]:
ageArr=pd.DataFrame(ages, columns = ['ages'])
ageArr

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   100

In [105]:
ageArr['age_cat']=cats
ageArr

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

In [ ]:
#value_conuts함수 : 값이 숫자, 문자열, 카테고리 값인 경우에 각각의 값이 나온 횟수를 세는 기능

In [108]:
#카테고리별로 나이 갯수 확인하기
ageArr['age_cat'].value_counts()

청년      3
미성년자    2
중년      2
장년      2
노년      1
Name: age_cat, dtype: int64

#### DataFrame 병합 : Concat 함수 사용

In [111]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']}, index=[0,1,2,3])

df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']}, index=[4,5,6,7])

df3 = pd.DataFrame({"A" : ["A8", "A9", "A10", "A11"],
                    "B" : ["B8", "B9", "B10", "B11"],
                    "C" : ["C8", "C9", "C10", "C11"],
                    "D" : ["D8", "D9", "D10", "D11"],
                    },index=[8,9,10,11])

In [112]:
result = pd.concat([df1,df2,df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Keys 속성 부여 시 다중 index가 된다.  keys값은 구분하는 값

In [113]:
result = pd.concat([df1,df2,df3], keys=['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [114]:
# 다중 index확인
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [115]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [116]:
#행 방향으로 병합하기
df4 = pd.DataFrame({'B':['B2','B3','B6','B7'],
                    'D':['D2','D3','D6','D7'],
                    'F':['F2','F3','F6','F7']},
                   index=[2,3,6,7])
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [119]:
result = pd.concat([df1,df4],axis=1)
result
#행방향으로 붙인다는 것은

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [118]:
#열방향으로 병합하는 경우
result = pd.concat([df1,df4],axis=0)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [120]:
result = pd.concat([df1,df4],axis=1,join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [121]:
result = pd.concat([df1,df4],axis=0,join='inner')
result

    B   D
0  B0  D0
1  B1  D1
2  B2  D2
3  B3  D3
2  B2  D2
3  B3  D3
6  B6  D6
7  B7  D7

In [122]:
#ignore_index : 기존의 인덱스를 무시하고 새로운 인덱스를 부여 함 , 열병합이 기본값, axis=0안써도 됨
result = pd.concat([df1,df4],ignore_index=True)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [128]:
result = pd.concat([df2,df4],ignore_index=True)
result

     A   B    C   D    F
0   A4  B4   C4  D4  NaN
1   A5  B5   C5  D5  NaN
2   A6  B6   C6  D6  NaN
3   A7  B7   C7  D7  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [126]:
result = pd.concat([df2,df4],axis=0)
result

     A   B    C   D    F
4   A4  B4   C4  D4  NaN
5   A5  B5   C5  D5  NaN
6   A6  B6   C6  D6  NaN
7   A7  B7   C7  D7  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7